       IDENTIFICATION DIVISION.
       PROGRAM-ID. EX04.
       AUTHOR. GABRIEL GOMES DA CRUZ / LUIZ HENRIQUE DE SANTANA.
       INSTALLATION. FATEC-SP.
       DATE-WRITTEN. 12/10/2023.
       DATE-COMPILED.
       SECURITY. APENAS O AUTOR PODE MODIFICAR.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           OBJECT-COMPUTER. IBM-PC.
           SOURCE-COMPUTER. IBM-PC.
           SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADESTOQ ASSIGN TO DISK ORGANIZATION is
               LINE SEQUENTIAL.
           SELECT RELESTOQ ASSIGN TO DISK.

       DATA DIVISION.
       FILE SECTION.
       
       FD CADESTOQ LABEL RECORD ARE STANDARD VALUE OF FILE-ID
         IS "CADESTOQ.DAT".
           01 REG-ENT.
             02 COD-ENT        PIC 9(05).
             02 NOME-ENT       PIC X(15).
             02 QNTD-ENT       PIC 9(05).
             02 PRECO-UNI-ENT  PIC 9(06)V99.

       FD RELESTOQ LABEL RECORD IS OMITTED.
           01 REL-ESTOQ PIC X(80).

       WORKING-STORAGE SECTION.
           77 FIM-ARQ PIC X(03) VALUE "NAO".
           77 CT-LIN  PIC 9(02) VALUE 27.
           77 CT-PAG  PIC 9(03) VALUE ZEROS.
           77 WCUSTO-TOT PIC 9(07)V99.

           77 WPRECO-TOT   PIC 9(08)V99 VALUE ZEROS.
           77 WPRECO-MEDIO PIC 9(06)V99 VALUE ZEROS.
           77 WQTND-TOT    PIC 9(07) VALUE ZEROS.

           01 CAB-01.
             02 FILLER PIC X(02) VALUE SPACES.
             02 FILLER PIC X(06) VALUE "DATA: ".
             02 DIA PIC 99 VALUE 12.
             02 FILLER PIC X(01) VALUE "/".
             02 MES PIC 99 VALUE 10.
             02 FILLER PIC X(01) VALUE "/".
             02 ANO PIC 9999 VALUE 2023.

             02 FILLER PIC X(10) VALUE SPACES.
             02 FILLER PIC X(33) VALUE 
              "RELATÓRIO DE MATERIAL EM ESTOQUE".
             
             02 FILLER PIC X(09) VALUE SPACES.
             02 FILLER PIC X(05) VALUE "PAG. ".
             02 VAR-PAG PIC 9(03).
             02 FILLER PIC X(02) VALUE SPACES.

           01 CAB-02.
             02 FILLER PIC X(05) VALUE SPACES.
             02 FILLER PIC X(06) VALUE "CODIGO".
             02 FILLER PIC X(09) VALUE SPACES.
             02 FILLER PIC X(04) VALUE "NOME".
             02 FILLER PIC X(10) VALUE SPACES.
             02 FILLER PIC X(07) VALUE "QTDE DO".
             02 FILLER PIC X(04) VALUE SPACES.
             02 FILLER PIC X(14) VALUE "CUSTO UNITARIO".
             02 FILLER PIC X(04) VALUE SPACES.
             02 FILLER PIC X(11) VALUE "CUSTO TOTAL".
             02 FILLER PIC X(06) VALUE SPACES. 
  
           01 CAB-03.
             02 FILLER PIC X(34) VALUE SPACES.
             02 FILLER PIC X(07) VALUE "ESTOQUE".
             02 FILLER PIC X(39) VALUE SPACES. 
  
           01 DETALHE.
             02 FILLER PIC X(05) VALUE SPACES.
             02 DET-COD PIC 99999.
             02 FILLER PIC X(04) VALUE SPACES.
             02 DET-NOME PIC X(15).
             02 FILLER PIC X(05) VALUE SPACES.
             02 DET-QNTD PIC ZZ.ZZ9.
             02 FILLER PIC X(06) VALUE SPACES.
             02 DET-CUSTO-UNI PIC ZZZ.ZZ9,99.
             02 FILLER PIC X(05) VALUE SPACES. 
             02 DET-CUSTO-TOT PIC Z.ZZZ.ZZ9,99.
             02 FILLER PIC X(06) VALUE SPACES.

           01 CAB-04.
             02 FILLER PIC X(08) VALUE SPACES.
             02 FILLER PIC X(16) VALUE "QUANTIDADE TOTAL".
             02 FILLER PIC X(11) VALUE SPACES.
             02 FILLER PIC X(13) VALUE "PREÇO MÉDIO".
             02 FILLER PIC X(12) VALUE SPACES.
             02 FILLER PIC X(12) VALUE "PREÇO TOTAL".
             02 FILLER PIC X(08) VALUE SPACES.

           01 DETALHE2.
             02 FILLER PIC X(12) VALUE SPACES.
             02 DET-QUTD-TOTAL-REL PIC Z.ZZZ.ZZ9 VALUE ZEROS.
             02 FILLER PIC X(15) VALUE SPACES.
             02 DET-PRECO-MEDIO-REL PIC ZZZ.ZZ9,99.
             02 FILLER PIC X(14) VALUE SPACES.
             02 DET-PRECO-TOTAL-REL PIC ZZ.ZZZ.ZZ9,99.
             02 FILLER PIC X(07) VALUE SPACES.

       PROCEDURE DIVISION.
       PGM-EX04.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TERMINO.
           STOP RUN.

       INICIO.
           OPEN INPUT CADESTOQ OUTPUT RELESTOQ.
           PERFORM LEITURA.

       LEITURA.
           READ CADESTOQ AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM IMPRESSAO.
           PERFORM LEITURA.

       IMPRESSAO.
           IF CT-LIN GREATER THAN 25
               PERFORM CABECALHO.
           PERFORM IMPRIME-DET.

       CABECALHO.
           MOVE 1 TO CT-LIN.
           ADD 1 TO CT-PAG.
           MOVE CT-PAG TO VAR-PAG.
           MOVE SPACES TO REL-ESTOQ.
           WRITE REL-ESTOQ AFTER ADVANCING PAGE.
           WRITE REL-ESTOQ FROM CAB-01 AFTER ADVANCING 1 LINE.
           WRITE REL-ESTOQ FROM CAB-02 AFTER ADVANCING 3 LINES.  
           WRITE REL-ESTOQ FROM CAB-03 AFTER ADVANCING 1 LINE.
           MOVE SPACES TO REL-ESTOQ.
           WRITE REL-ESTOQ AFTER ADVANCING 1 LINE.

       IMPRIME-DET.
           ADD 1 TO CT-LIN.
           MULTIPLY PRECO-UNI-ENT BY QNTD-ENT GIVING WCUSTO-TOT.
           MOVE COD-ENT TO DET-COD.
           MOVE NOME-ENT TO DET-NOME.
           MOVE QNTD-ENT TO DET-QNTD.
           MOVE PRECO-UNI-ENT TO DET-CUSTO-UNI.
           MOVE WCUSTO-TOT TO DET-CUSTO-TOT.
           WRITE REL-ESTOQ FROM DETALHE AFTER ADVANCING 1 LINE.

           ADD QNTD-ENT TO WQTND-TOT.
           ADD WCUSTO-TOT TO WPRECO-TOT.

       IMPRIME-TOT.
           ADD 1 TO CT-PAG.
           MOVE CT-PAG TO VAR-PAG.
           MOVE SPACES TO REL-ESTOQ.
           WRITE REL-ESTOQ AFTER ADVANCING PAGE.
           WRITE REL-ESTOQ FROM CAB-01 AFTER ADVANCING 1 LINE.
           WRITE REL-ESTOQ FROM CAB-04 AFTER ADVANCING 3 LINES.  
           MOVE SPACES TO REL-ESTOQ.
           WRITE REL-ESTOQ AFTER ADVANCING 1 LINE.

           DIVIDE WPRECO-TOT BY WQTND-TOT GIVING WPRECO-MEDIO.
           MOVE WQTND-TOT TO DET-QUTD-TOTAL-REL.
           MOVE WPRECO-MEDIO TO DET-PRECO-MEDIO-REL.
           MOVE WPRECO-TOT TO DET-PRECO-TOTAL-REL.
           WRITE REL-ESTOQ FROM DETALHE2 AFTER ADVANCING 1 LINE.

       TERMINO.
           PERFORM IMPRIME-TOT.
           CLOSE CADESTOQ RELESTOQ.
                     

       