       IDENTIFICATION DIVISION.
       PROGRAM-ID.      EX06.
       AUTHOR.          GABRIEL GOMES DA CRUZ.
       INSTALLATION.    FATEC-SP.
       DATE-WRITTEN.    06/09/2023.
       DATE-COMPILED.
       SECURITY. APENAS O AUTOR PODE MODIFICAR.
      *REMARKS.  LER O ARQUIVO DE ENTRADA CADENT (MATRICULA, NOME E 
      *          SALARIO BRUTO) E GRAVAR O ARQUIVO DE SAIDA CADSAI
      *          (MATRICULA, NOME E SALARIO BRUTO) SE TIVER  
      *          SALARIO BRUTO MAIOR OU IGUAL A 3000,00.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SOURCE-COMPUTER.   ACER-PC.
           OBJECT-COMPUTER.   HP-PC.
           SPECIAL-NAMES. DECIMAL-POINT IS COMMA.
       
       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
           SELECT CADENT ASSIGN TO DISK ORGANIZATION 
               IS LINE SEQUENTIAL.
           SELECT CADSAI ASSIGN TO DISK ORGANIZATION
               IS LINE SEQUENTIAL.
       
       DATA DIVISION.
       FILE SECTION.
           FD CADENT LABEL RECORD ARE STANDARD VALUE OF FILE-ID
               IS "CADENT.DAT".

           01 REG-ENT.
           02 MATRICULA-ENT    PIC 9(05).
           02 NOME-ENT         PIC X(30).
           02 SAL-BRUT-ENT     PIC 9(05)V99.

           FD CADSAI LABEL RECORD ARE STANDARD VALUE OF FILE-ID
               IS "CADSAI.DAT".

           01 REG-SAI.
           02 MATRICULA-SAI    PIC 9(05).
           02 NOME-SAI         PIC X(30).
           02 SAL-BRUT-SAI     PIC 9(05)V99.

       WORKING-STORAGE SECTION.
           77 FIM-ARQ PIC X(03) VALUE "NAO".

       PROCEDURE DIVISION.
       PGM-EX06.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TERMINO.
           STOP RUN.
       
       INICIO.
           OPEN INPUT CADENT OUTPUT CADSAI.
           PERFORM LEITURA.

       LEITURA.
           READ CADENT AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM SELECAO.
           PERFORM LEITURA.

       SELECAO.
           IF SAL-BRUT-ENT GREATER THAN 3000,00
               PERFORM GRAVACAO.

       GRAVACAO.
           MOVE MATRICULA-ENT TO MATRICULA-SAI.
           MOVE NOME-ENT TO NOME-SAI.
           MOVE SAL-BRUT-ENT TO SAL-BRUT-SAI.
           WRITE REG-SAI.

       TERMINO.
           CLOSE CADENT CADSAI.