       IDENTIFICATION DIVISION.
       PROGRAM-ID.      EX05.
       AUTHOR.          GABRIEL GOMES DA CRUZ.
       INSTALLATION.    FATEC-SP.
       DATE-WRITTEN.    06/09/2023.
       DATE-COMPILED.
       SECURITY. APENAS O AUTOR PODE MODIFICAR.
      *REMARKS.  LER O ARQUIVO DE ENTRADA CADATU (CODIGO, NOME, NOTA1, 
      *          NOTA2 E FALTAS) E GRAVAR O ARQUIVO DE SAIDA CADAPR
      *          (CODIGO, NOME E MEDIA) SE TIVER FALTAS MENOR OU  
      *          IGUAL A 18 E MEDIA MAIOR OU IGUAL A 6.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SOURCE-COMPUTER.   ACER-PC.
           OBJECT-COMPUTER.   IBM-PC.
           SPECIAL-NAMES. DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
           SELECT CADALU ASSIGN TO DISK ORGANIZATION 
               IS LINE SEQUENTIAL.
           SELECT CADAPR ASSIGN TO DISK ORGANIZATION
               IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
           FD CADALU LABEL RECORD ARE STANDARD VALUE OF FILE-ID
               IS "CADALU.DAT".

           01 REG-ENT.
           02 NUM-ENT      PIC 9(05).
           02 NOME-ENT     PIC X(20).
           02 NOTA1-ENT    PIC 9(02)V99.
           02 NOTA2-ENT    PIC 9(02)V99.
           02 FALTAS-ENT   PIC 9(02).

           FD CADAPR LABEL RECORD ARE STANDARD VALUE OF FILE-ID
               IS "CADAPR.DAT".

           01 REG-SAI.
           02 NUM-SAI      PIC 9(05).
           02 NOME-SAI     PIC X(20).
           02 MEDIA-SAI    PIC 9(02)V99.

       WORKING-STORAGE SECTION.
           77 FIM-ARQ PIC X(03) VALUE "NAO".
           77 SOMA-NOTA PIC 9(02)V99 VALUE ZEROS.
           77 WMEDIA PIC 9(02)V99 VALUE ZEROS.

       PROCEDURE DIVISION.
       PGM-EX05.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TERMINO.
           STOP RUN.

       INICIO.
           OPEN INPUT CADALU OUTPUT CADAPR.
           PERFORM LEITURA.
       
       LEITURA.
           READ CADALU AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM CALCMEDIA.
           PERFORM SELECAO.
           PERFORM LEITURA.

       CALCMEDIA.
           ADD NOTA1-ENT NOTA2-ENT GIVING SOMA-NOTA.
           DIVIDE SOMA-NOTA BY 2 GIVING WMEDIA.

       SELECAO.
           IF WMEDIA NOT LESS THAN 7,00 AND 
               FALTAS-ENT NOT GREATER THAN 18
              PERFORM GRAVACAO.
       
       GRAVACAO.
           MOVE NUM-ENT TO NUM-SAI.
           MOVE NOME-ENT TO NOME-SAI.
           MOVE WMEDIA TO MEDIA-SAI.
           WRITE REG-SAI.

       TERMINO.
           CLOSE CADALU CADAPR.


           

       
