       IDENTIFICATION DIVISION.
       PROGRAM-ID.        EX06.
       AUTHOR.            GABRIEL GOMES DA CRUZ.
       INSTALLATION.      FATEC-SP.
       DATE-WRITTEN.      08/09/2023.
       DATE-COMPILED.
       SECURITY.          APENAS O AUTOR PODE MODIFICAR.
      *REMARKS.           LER O ARQUIVO DE ENTRADA CADALU (NUMERO,
      *                   NOME, NOTA1, NOTA2, NOTA3, NOTA4 E SEXO), 
      *                   CALCULAR A MEDIA E GRAVAR NO ARQUIVO DE
      *                   SAIDA CADATU (NUMERO, NOME, MEDIA E SEXO)
      *                   APENAS CASO O SEXO SEJA FEMININO.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SOURCE-COMPUTER.   LG-PC.
           OBJECT-COMPUTER.   IBM-PC.
           SPECIAL-NAMES.     DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
           SELECT CADALU ASSIGN TO DISK ORGANIZATION
               IS LINE SEQUENTIAL.
           SELECT CADATU ASSIGN TO DISK ORGANIZATION 
               IS LINE SEQUENTIAL.
       
       DATA DIVISION.
       FILE SECTION.
           FD CADALU LABEL RECORD ARE STANDARD VALUE OF FILE-ID
               IS "CADALU.DAT".
           
           01 REG-ENT.
           02 NUM-ENT      PIC 9(05).
           02 NOME-ENT     PIC X(20).
           02 NOTA1-ENT    PIC 9(02)V99.
           02 NOTA2-ENT    PIC 9(02)V99.
           02 NOTA3-ENT    PIC 9(02)V99.
           02 NOTA4-ENT    PIC 9(02)V99.
           02 SEXO-ENT     PIC X(01).

           FD CADATU LABEL RECORD ARE STANDARD VALUE OF FILE-ID
               IS "CADATU.DAT".

           01 REG-SAI.
           02 NUM-SAI      PIC 9(05).
           02 NOME-SAI     PIC X(20).
           02 MEDIA-SAI    PIC 9(02)V99.
           02 SEXO-SAI     PIC X(01).

       WORKING-STORAGE SECTION.
           77 FIM-ARQ      PIC X(03) VALUE "NAO".
           77 SOMA-NOTA    PIC 9(02)V99 VALUE ZEROS.
           77 WMEDIA       PIC 9(02)V99 VALUE ZEROS.

       PROCEDURE DIVISION.
       PGM-EX07.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TERMINO.
           STOP RUN.

       INICIO.
           OPEN INPUT CADALU OUTPUT CADATU.
           PERFORM LEITURA.

       LEITURA.
           READ CADALU AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM SELECAO.
           PERFORM LEITURA.

       SELECAO.
           IF SEXO-ENT EQUAL "F" OR "f"
               PERFORM CALCMEDIA
               PERFORM GRAVACAO.
       
       CALCMEDIA.
           ADD NOTA1-ENT NOTA2-ENT NOTA3-ENT NOTA4-ENT
               GIVING SOMA-NOTA.
           DIVIDE SOMA-NOTA BY 4 GIVING WMEDIA.

       GRAVACAO.
           MOVE NUM-ENT TO NUM-SAI.
           MOVE NOME-ENT TO NOME-SAI.
           MOVE WMEDIA TO MEDIA-SAI.
           MOVE SEXO-ENT TO SEXO-SAI.
           WRITE REG-SAI.

       TERMINO.
           CLOSE CADALU CADATU.